app/views/spams/index.html.erb

<div class="comments_canvas">
	<h2 class="comment_count"><%= pluralize(@post.spams.count, "spam") %> on this grill rack
---
SELECT "spams".* FROM "spams" WHERE ("spams".post_id = 5)
SELECT COUNT(*) FROM "spams" WHERE ("spams".post_id = 1)