app/views/archives/index.html.erb

SELECT "comments".* FROM "comments" WHERE ("comments".post_id = 4)
SELECT COUNT(*) FROM "comments" WHERE ("comments".post_id = 1)
---
			<% if current_user %>
			<% if post.comments.count > 0 %>