app/views/posts/_meta.html.erb

<% if post.comments.count == 0 %>
---
SELECT "comments".* FROM "comments" WHERE ("comments".post_id = 1)
SELECT COUNT(*) FROM "comments" WHERE ("comments".post_id = 1)