app/views/posts/edit.html.erb

	<p class="meta">
		<% if @post.comments.count == 0 %>
---
SELECT "comments".* FROM "comments" WHERE ("comments".post_id = 4) ORDER BY comments.id DESC LIMIT 1
SELECT COUNT(*) FROM "comments" WHERE ("comments".post_id = 2)